docs/pia/echo.yml

method: POST
url:
  target: http://webservices.daehosting.com/services/isbnservice.wso
headers:
  Content-Type: text/xml
  SOAPAction: "#POST"
body:
  inline: |
    <?xml version="1.0" encoding="utf-8"?>
    <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
      <soap:Body>
        <IsValidISBN10 xmlns="http://webservices.daehosting.com/ISBN">
          <sISBN>${props:isbn|1234-1234}</sISBN>
        </IsValidISBN10>
      </soap:Body>
    </soap:Envelope>
hooks:
  after:
    inline: |
      assert(response.status_code == 200, "");
      var xml = response.xml();
      if xml.Body.IsValidISBN10Response.IsValidISBN10Result."_inner" == "true" {
        println("The ISBN ${props:isbn|1234-1234} is valid!");
      }
